uhnp/src/Catalogs/ПретензииУХ/ПретензииУХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПретензииУХ</name>
  <basedOn>Catalog.Лоты</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ОтражениеФактическихДанныхБюджетирования</basedOn>
  <basedOn>Document.АккредитацияПоставщика</basedOn>
  <basedOn>Document.КвалификацияПоставщика</basedOn>
  <basedOn>Document.ВозвратТоваровПоставщику</basedOn>
  <attributes>
    <name>ТипПретензии</name>
    <type>
      <types>EnumRef.ТипыПретензий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСпора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтражаетсяВ_БДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияПретензий</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ХодПретензионноИсковойРаботы/ХодПретензионноИсковойРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХодПретензионноИсковойРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтапРаботы</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вероятность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПозицияОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПозицияКонтрагента</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Суд</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Судья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НомерДела</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодПланирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>Пени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ОжидаемаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийЭтапПретензии</name>
    <type>
      <types>CatalogRef.ЭтапыПретензионноИсковойРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.ПретензииУХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПретензииУХ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХодПретензионноИсковойРаботыСрезПоследних.Регистратор КАК Регистратор,
			|	ХодПретензионноИсковойРаботыСрезПоследних.Период
			|ИЗ
			|	РегистрСведений.ХодПретензионноИсковойРаботы.СрезПоследних(&Период, Претензия = &Ссылка) КАК ХодПретензионноИсковойРаботыСрезПоследних";
		
		Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Период = ВыборкаДетальныеЗаписи.Период;
			Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина;
	Если Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("Документ.ИзменениеПретензии.ФормаОбъекта", Новый Структура("Основание", Объект.Основание), ВладелецФормы);
	Иначе
		Если НЕ Регистратор.Пустая() И Период = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) Тогда
			ОткрытьФорму("Документ.ИзменениеПретензии.ФормаОбъекта", Новый Структура("Ключ", Регистратор), ВладелецФормы);
		Иначе
			ОткрытьФорму("Документ.ИзменениеПретензии.ФормаОбъекта", Новый Структура("Основание", Объект.Ссылка), ВладелецФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПретензии()
	ОткрытьФорму("Документ.ИзменениеПретензии.ФормаОбъекта", Новый Структура("Основание", ?(ЗначениеЗаполнено(Объект.Основание), Объект.Основание, Объект.Ссылка)), ВладелецФормы);
КонецПроцедуры
